print("Вітаю!")
score = 0
# запитання 1
answer1 = input("Яка найбільша річка України? ")
if answer1 == "Дніпро":
    print("Правильно!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Дніпро")
# запитання 2
answer2 = input("Скільки континентів на Землі? ")
if answer2 == "6":
    print("Правильно!")
    score += 1
else:
    print("Неправильно. Правильна відповідь: 6")
# запитання 3
answer3 = input("Скільки днів у тижні? ")
if answer3 == "7":
    print("Правильно!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: 7")

print(f"Вітаю! Ви завершили гру.")
print(f"Ваш рахунок: {score} з 3 балів")
